src/toir_cfe/src/DataProcessors/проф_ЗапроситьПеремещениеУДругогоПодразделения/проф_ЗапроситьПеремещениеУДругогоПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ЗапроситьПеремещениеУДругогоПодразделения</name>
</mdclass:DataProcessor>

src/toir_cfe/src/AccumulationRegisters/проф_ЗапасыИПотребности/проф_ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0c3966d-a188-422d-ae41-58971b18740e">
  <name>проф_ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="a09d559f-5429-40de-881e-a7a7455b0805">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3eba9edd-c306-45b3-adbf-0b6bd792797b">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3ff46c0a-d6a1-44d9-93cd-bd1c74e17152">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="796c95c7-1cc0-402b-a66a-b61c30c88768">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8d117610-557c-447a-826b-0939b2755cf2">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce740e0e-f426-41c7-a111-3357412b36f3">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c2c3b72e-9d8c-413c-a97a-18ce1c487b01">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c65a1e77-9998-4c19-8ead-3d53094b11d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f3780b58-1e35-42a5-ae55-269d2c78e18b">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bb4e1824-62e1-414d-8f98-544e41852af9">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="b13a9fdf-bf1e-4886-8c71-f4facd56f75f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="490da68d-96cb-4e58-bbe6-b68b05d368f7">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b8faf3e1-e88d-430a-9d3b-8fcdf9a97ee7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="904aec5b-9e35-480e-867f-ca8b2baae6d1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/проф_НастройкиСистемы/проф_НастройкиСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6e97bacd-581f-457e-8194-0e56df384c90">
  <name>проф_НастройкиСистемы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="eabacba6-c7c4-412a-966b-4fb545be0373">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c4e4dd9-9400-4bf0-9b2e-c1573d654f58">
    <name>СодержитСписок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f7730688-f0b4-4a4e-bd02-3164755a6070">
    <name>Список</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ab1fcde9-7b4c-4938-b9c2-6ef7d23645d2">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Catalogs/проф_Назначения/проф_Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9ffd7683-e584-474a-b265-31df63ffc5a9">
  <name>проф_Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="710428d6-cf35-40d5-ba2f-b8358d3e48d1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ac1cff61-ca3f-43ba-98e8-a73eede81b43">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe2cc228-8fb0-4209-9c64-f8d7349cf1a0">
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d873557d-2cd2-49b8-b9b9-ba74907ab271">
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfcd486f-ce81-4d09-95fb-ac1dc450ccc2">
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0005b69f-a259-4c75-ac02-65ccc9e14578">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2635dfe1-50d3-44bc-b327-52eaf52f459d">
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b2e17e5-1e7a-4d58-a2ee-2b5810f1fb86">
    <name>ТипОбъектаНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30556ed4-3c87-4803-9f56-54b8640f13fa">
    <name>CostCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d17a6c84-8090-4a0b-be0c-41c4f0e1e94b">
    <name>ИДЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/DataProcessors/проф_ЗапроситьПеремещениеУДругогоПодразделения/Forms/Форма/Module.bsl
//++ Проф-ИТ, #72, Сергеев Д., 13.10.2023

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТовары") И Параметры.АдресТовары <> Неопределено Тогда
		СтруктураТовары = ПолучитьИзВременногоХранилища(Параметры.АдресТовары);
		ТоварыИсходные.Загрузить(СтруктураТовары.ТаблицаТовары);
		ДокументДляСогласования = СтруктураТовары.ДокументДляСогласования;
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
	ЗаполнитьСписокВыбораНазначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запросить(Команда)
	
	ОтправитьИЗакрыть = Истина;  
	
	ПроверитьПередОтправкойНаСогласование(ОтправитьИЗакрыть); 
	Если ОтправитьИЗакрыть Тогда
		Закрыть(ПоместитьТоварыВХранилище());	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	СтруктураТовары = Новый Структура("Товары, ТоварыИсходные");
	СтруктураТовары.Товары         = Товары.Выгрузить();
	СтруктураТовары.ТоварыИсходные = ТоварыИсходные.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураТовары, Новый УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораНазначения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Склад КАК Склад,
	|	Таблица.Количество КАК КоличествоИсходное
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_НастройкиСистемыСписок.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ПодразделениеИсключить
	|ИЗ
	|	Справочник.проф_НастройкиСистемы.Список КАК проф_НастройкиСистемыСписок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_НастройкиСистемы КАК проф_НастройкиСистемы
	|		ПО проф_НастройкиСистемыСписок.Ссылка = проф_НастройкиСистемы.Ссылка
	|ГДЕ
	|	проф_НастройкиСистемы.Наименование = ""ПодразделенияСлужбыТОиР""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	проф_НастройкиСистемы.Значение
	|ИЗ
	|	Справочник.проф_НастройкиСистемы КАК проф_НастройкиСистемы
	|ГДЕ
	|	проф_НастройкиСистемы.Наименование = ""ПодразделенияСлужбыТОиР""
	|;
	|
	//++ Проф-ИТ, #337, Соловьев А.А., 04.11.2023
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	проф_ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|	проф_ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|	проф_ЗапасыИПотребностиОстатки.Склад КАК Склад,
	|	СУММА(проф_ЗапасыИПотребностиОстатки.ВНаличииОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток) КАК ВНаличии
	|ПОМЕСТИТЬ втЗапасыИПотребности
	|ИЗ
	|	РегистрНакопления.проф_ЗапасыИПотребности.Остатки(
	|			,
	|			(Номенклатура, Характеристика, Склад) В
	|				(ВЫБРАТЬ
	|					ВТ_Товары.Номенклатура КАК Номенклатура,
	|					ВТ_Товары.Характеристика КАК Характеристика,
	|					ВТ_Товары.Склад КАК Склад
	|				ИЗ
	|					ВТ_Товары КАК ВТ_Товары)) КАК проф_ЗапасыИПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура,
	|	проф_ЗапасыИПотребностиОстатки.Характеристика,
	|	проф_ЗапасыИПотребностиОстатки.Назначение,
	|	проф_ЗапасыИПотребностиОстатки.Склад
	|;
	//-- Проф-ИТ, #337, Соловьев А.А., 04.11.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.НомерСтроки КАК НомерСтрокиИсточника,
	|	ЕСТЬNULL(втЗапасыИПотребности.Назначение, НЕОПРЕДЕЛЕНО) КАК Назначение,
	|	СУММА(ЕСТЬNULL(втЗапасыИПотребности.ВНаличии, 0)) КАК КоличествоОстаток,
	|	проф_Назначения.Подразделение КАК Подразделение,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ВТ_Товары.Склад КАК Склад,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.КоличествоИсходное КАК КоличествоИсходное,
	|	проф_Назначения.ИДЗаказа КАК ИДЗаказа
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗапасыИПотребности КАК втЗапасыИПотребности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|			ПО втЗапасыИПотребности.Назначение = проф_Назначения.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделениеИсключить КАК ВТ_ПодразделениеИсключить
	|			ПО (проф_Назначения.Подразделение = ВТ_ПодразделениеИсключить.Значение)
	|		ПО ВТ_Товары.Номенклатура = втЗапасыИПотребности.Номенклатура
	|			И ВТ_Товары.Характеристика = втЗапасыИПотребности.Характеристика
	|			И ВТ_Товары.Склад = втЗапасыИПотребности.Склад
	|ГДЕ
	|	НЕ проф_Назначения.Заказ ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|	И ВТ_ПодразделениеИсключить.Значение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.НомерСтроки,
	|	ЕСТЬNULL(втЗапасыИПотребности.Назначение, НЕОПРЕДЕЛЕНО),
	|	проф_Назначения.Подразделение,
	|	ВТ_Товары.Характеристика,
	|	ВТ_Товары.Склад,
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.КоличествоИсходное,
	|	проф_Назначения.ИДЗаказа";
	
	Запрос.УстановитьПараметр("Таблица", ТоварыИсходные.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, Склад, Количество"));
	РезультатЗапроса = Запрос.Выполнить();  
	Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
	//ВыборкаНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Выборка = РезультатЗапроса.Выбрать();
	
	//СоответствиеНомерСтроки = Новый Соответствие;
	//Пока ВыборкаНомерСтроки.Следующий() Цикл
	//	
	//	Выборка = ВыборкаНомерСтроки.Выбрать(); 
	//	мсвНазначений = Новый Массив;
	//	Пока Выборка.Следующий() Цикл  
	//		СтруктураНазначения = Новый Структура("Назначение, Подразделение, КоличествоОстаток", Выборка.Назначение, Выборка.Подразделение, Выборка.КоличествоОстаток);
	//		мсвНазначений.Добавить(СтруктураНазначения);			
	//	КонецЦикла;
	//	СоответствиеНомерСтроки.Вставить(ВыборкаНомерСтроки.НомерСтроки, мсвНазначений); 
	//	
	//КонецЦикла;
	
	//АдресСписокВыбораНазначений = ПоместитьВоВременноеХранилище(СоответствиеНомерСтроки, УникальныйИдентификатор);
	
КонецПроцедуры // ЗаполнитьСписокВыбораНазначения()

&НаКлиенте
Процедура ПроверитьПередОтправкойНаСогласование(ОтправитьИЗакрыть)  
	
	ПолучитьТаблицуОстаков();
	
	НаименованиеШаблона = "Согласование изменения заказа";
	
	ЕстьОшибки = Ложь;
	
	Для каждого текСтрока Из ТоварыИсходные Цикл 
		ПараметрОтбора = Новый Структура("НомерСтрокиИсточника", текСтрока.НомерСтроки);
		НайденныеСтроки = Товары.НайтиСтроки(ПараметрОтбора);
		
		Если НайденныеСтроки <> Неопределено Тогда
	
			Количество = 0;
			Для каждого текЭлемент Из НайденныеСтроки Цикл
			    Количество = Количество + текЭлемент.Количество;
			КонецЦикла;
		
		КонецЕсли;
		
		Если текСтрока.Количество < Количество Тогда
			
			ТекстСообщения = Нстр("ru = 'Нельзя запросить больше, чем указано в документе по строке № %1!'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, текСтрока.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
		
		КонецЕсли;		
	КонецЦикла;	
  	
	СтрокиОстаткиНом = ДеревоТовары.ПолучитьЭлементы();
	Для каждого СтрОстаткиНом Из СтрокиОстаткиНом Цикл
		
		СтрокиОстаткиПодр = СтрОстаткиНом.ПолучитьЭлементы();
		Для каждого СтрОстаткиПодр Из СтрокиОстаткиПодр Цикл
			
			СтрокиИДЗаказа = СтрОстаткиПодр.ПолучитьЭлементы();
			Для каждого СтрИДЗаказа Из СтрокиИДЗаказа Цикл
				
				
				СтрокиОстатки = СтрИДЗаказа.ПолучитьЭлементы(); 
				Для каждого СтрОстатки Из СтрокиОстатки Цикл
					Если СтрОстатки.Количество < 0 Тогда
						ТекстСообщения = Нстр("ru = 'Нельзя запросить больше, чем есть в наличии по строке %1!'"); 
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрОстатки.НомерСтроки);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						
						ЕстьОшибки = Истина; 
					КонецЕсли;     
					
					Если СтрОстатки.Количество > СтрОстатки.КоличествоОстаток Тогда 
						ТекстСообщения = Нстр("ru = 'Строка %1 - количество к согласованию должно быть не больше остатка резерва.'"); 
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрОстатки.НомерСтроки);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						
						ЕстьОшибки = Истина;
					КонецЕсли; 
				КонецЦикла;
				
			КонецЦикла;
			
			
		КонецЦикла;	
	КонецЦикла;

	ОтправитьИЗакрыть = НЕ ЕстьОшибки;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтартоватьПроцесс(ТипПроцесса, ПараметрыЗапуска)
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	Если ПараметрыЗапуска.Свойство("Предмет") Тогда
		ШаблонПроцесса = ИнтеграцияС1СДокументооборот.НовыйБизнесПроцессПоШаблону(Прокси, ТипПроцесса, ПараметрыЗапуска.Шаблон, ПараметрыЗапуска.Предмет);
	Иначе
		ШаблонПроцесса = ИнтеграцияС1СДокументооборот.НовыйБизнесПроцессПоШаблону(Прокси, ТипПроцесса, ПараметрыЗапуска.Шаблон);
	КонецЕсли;
	ШаблонПроцесса.description = ПараметрыЗапуска.Описание;   
	
	НовыйПроцесс = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, ШаблонПроцесса.ObjectID.type);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьЗначенияСвойствXDTO(Прокси, НовыйПроцесс, ШаблонПроцесса);
	
	РезультатЗапуска = ИнтеграцияС1СДокументооборот.ЗапуститьБизнесПроцесс(Прокси, НовыйПроцесс);
		
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, РезультатЗапуска, "DMError") Тогда
		Возврат Ложь;
	Иначе
		ПроцессID = РезультатЗапуска.businessProcess.ObjectID.ID;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеПредметаСогласования(ДокументДляСогласования)
	
	Если ЗначениеЗаполнено(ДокументДляСогласования) Тогда		
		возврат "Заказ на ВПТ "+ДокументДляСогласования.Номер + " от "+ДокументДляСогласования.Дата+"/"+ДокументДляСогласования.Подразделение;
	иначе		
		возврат "";		
	КонецЕсли; 
	
	////"Заказ на ВПТ  
КонецФункции


&НаКлиенте
Процедура ТоварыНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СоответствиеНомерСтроки = ПолучитьИзВременногоХранилища(АдресСписокВыбораНазначений);
	НомерСтроки = Элементы.Товары.ТекущаяСтрока + 1;
	мсвНазначения = СоответствиеНомерСтроки.Получить(НомерСтроки);  
	
	Элемент.СписокВыбора.Очистить();
	Если мсвНазначения <> Неопределено Тогда
		Для каждого текЭлемент Из мсвНазначения Цикл
			Элемент.СписокВыбора.Добавить(текЭлемент.Назначение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНазначениеПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНазначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		СоответствиеНомерСтроки = ПолучитьИзВременногоХранилища(АдресСписокВыбораНазначений);
		НомерСтроки = Элементы.Товары.ТекущаяСтрока + 1;
		мсвНазначения = СоответствиеНомерСтроки.Получить(НомерСтроки); 
		
		текСтрока = Товары[Элементы.Товары.ТекущаяСтрока];
		Для каждого текЭлемент Из мсвНазначения Цикл 
			Если текЭлемент.Назначение = ВыбранноеЗначение Тогда
			    текСтрока.КоличествоОстаток = текЭлемент.КоличествоОстаток; 
				текСтрока.Подразделение     = текЭлемент.Подразделение;
			КонецЕсли;
			Элемент.СписокВыбора.Добавить(текЭлемент.Назначение);
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуОстаков() 
	
	мсвГруппировкиКолонок = Новый Массив;
	мсвГруппировкиКолонок.Добавить("Подразделение");
	мсвГруппировкиКолонок.Добавить("Номенклатура");
	мсвГруппировкиКолонок.Добавить("ИДЗаказа");
	
	текДеревоОстатки = ТаблицаЗначенийВДеревоЗначений(Товары.Выгрузить(), мсвГруппировкиКолонок);
	
	ЗначениеВРеквизитФормы(текДеревоОстатки, "ДеревоТовары");
	
КонецПроцедуры // ПолучитьТаблицуОстаков()

&НаСервере
Функция ТаблицаЗначенийВДеревоЗначений(ТаблЗначений, мсвГруппировкиКолонок)
	
	ПострЗапроса             		= Новый ПостроительЗапроса;
	ПострЗапроса.ИсточникДанных             = Новый ОписаниеИсточникаДанных(ТаблЗначений);
	
	ПострЗапроса.ДобавлениеПредставлений 	= ТипДобавленияПредставлений.НеДобавлять; 
	Для каждого текЭлемент Из мсвГруппировкиКолонок Цикл
	    ПострЗапроса.ИсточникДанных.Колонки[текЭлемент].Измерение = Истина;
	КонецЦикла;
	
	ПострЗапроса.ЗаполнитьНастройки();
	ПострЗапроса.Выполнить();
	
	ДеревоЗн = ПострЗапроса.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ДеревоЗн;

КонецФункции

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Номенклатура)            
	
	ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
	
		 ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
		 
	КонецЕсли;
	
    Возврат ЕдиницаИзмерения;
	
КонецФункции // ()

#КонецОбласти

//-- Проф-ИТ, #72, Сергеев Д., 13.10.2023
